RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/src/bl602_romapi.c
#include "bl602_romdriver.h"

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION AON_Power_On_MBG(void)
{
    return RomDriver_AON_Power_On_MBG();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION AON_Power_Off_MBG(void)
{
    return RomDriver_AON_Power_Off_MBG();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION AON_Power_On_XTAL(void)
{
    return RomDriver_AON_Power_On_XTAL();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION AON_Set_Xtal_CapCode(uint8_t capIn, uint8_t capOut)
{
    return RomDriver_AON_Set_Xtal_CapCode(capIn, capOut);
}

__ALWAYS_INLINE
uint8_t ATTR_CLOCK_SECTION AON_Get_Xtal_CapCode(void)
{
    return RomDriver_AON_Get_Xtal_CapCode();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION AON_Power_Off_XTAL(void)
{
    return RomDriver_AON_Power_Off_XTAL();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_On_BG(void)
{
    return RomDriver_AON_Power_On_BG();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_Off_BG(void)
{
    return RomDriver_AON_Power_Off_BG();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_On_LDO11_SOC(void)
{
    return RomDriver_AON_Power_On_LDO11_SOC();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_Off_LDO11_SOC(void)
{
    return RomDriver_AON_Power_Off_LDO11_SOC();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_On_LDO15_RF(void)
{
    return RomDriver_AON_Power_On_LDO15_RF();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_Off_LDO15_RF(void)
{
    return RomDriver_AON_Power_Off_LDO15_RF();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_On_SFReg(void)
{
    return RomDriver_AON_Power_On_SFReg();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_Power_Off_SFReg(void)
{
    return RomDriver_AON_Power_Off_SFReg();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_LowPower_Enter_PDS0(void)
{
    return RomDriver_AON_LowPower_Enter_PDS0();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION AON_LowPower_Exit_PDS0(void)
{
    return RomDriver_AON_LowPower_Exit_PDS0();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION ASM_Delay_Us(uint32_t core, uint32_t cnt)
{
    return RomDriver_ASM_Delay_Us(core, cnt);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION BL602_Delay_US(uint32_t cnt)
{
    return RomDriver_BL602_Delay_US(cnt);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION BL602_Delay_MS(uint32_t cnt)
{
    return RomDriver_BL602_Delay_MS(cnt);
}

__ALWAYS_INLINE
void *ATTR_TCM_SECTION BL602_MemCpy(void *dst, const void *src, uint32_t n)
{
    return RomDriver_BL602_MemCpy(dst, src, n);
}

__ALWAYS_INLINE
uint32_t *ATTR_TCM_SECTION BL602_MemCpy4(uint32_t *dst, const uint32_t *src, uint32_t n)
{
    return RomDriver_BL602_MemCpy4(dst, src, n);
}

__ALWAYS_INLINE
void *ATTR_TCM_SECTION BL602_MemCpy_Fast(void *pdst, const void *psrc, uint32_t n)
{
    return RomDriver_BL602_MemCpy_Fast(pdst, psrc, n);
}

__ALWAYS_INLINE
void *ATTR_TCM_SECTION BL602_MemSet(void *s, uint8_t c, uint32_t n)
{
    return RomDriver_BL602_MemSet(s, c, n);
}

__ALWAYS_INLINE
uint32_t *ATTR_TCM_SECTION BL602_MemSet4(uint32_t *dst, const uint32_t val, uint32_t n)
{
    return RomDriver_BL602_MemSet4(dst, val, n);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION BL602_MemCmp(const void *s1, const void *s2, uint32_t n)
{
    return RomDriver_BL602_MemCmp(s1, s2, n);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION EF_Ctrl_Sw_AHB_Clk_0(void)
{
    return RomDriver_EF_Ctrl_Sw_AHB_Clk_0();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION EF_Ctrl_Program_Efuse_0(void)
{
    return RomDriver_EF_Ctrl_Program_Efuse_0();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION EF_Ctrl_Load_Efuse_R0(void)
{
    return RomDriver_EF_Ctrl_Load_Efuse_R0();
}

__ALWAYS_INLINE
BL_Sts_Type ATTR_TCM_SECTION EF_Ctrl_Busy(void)
{
    return RomDriver_EF_Ctrl_Busy();
}

__ALWAYS_INLINE
BL_Sts_Type ATTR_TCM_SECTION EF_Ctrl_AutoLoad_Done(void)
{
    return RomDriver_EF_Ctrl_AutoLoad_Done();
}

__ALWAYS_INLINE
uint8_t ATTR_CLOCK_SECTION EF_Ctrl_Get_Trim_Parity(uint32_t val, uint8_t len)
{
    return RomDriver_EF_Ctrl_Get_Trim_Parity(val, len);
}

__ALWAYS_INLINE
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32M_Trim(Efuse_Ana_RC32M_Trim_Type *trim)
{
    return RomDriver_EF_Ctrl_Read_RC32M_Trim(trim);
}

__ALWAYS_INLINE
void ATTR_CLOCK_SECTION EF_Ctrl_Read_RC32K_Trim(Efuse_Ana_RC32K_Trim_Type *trim)
{
    return RomDriver_EF_Ctrl_Read_RC32K_Trim(trim);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION EF_Ctrl_Clear(uint32_t index, uint32_t len)
{
    return RomDriver_EF_Ctrl_Clear(index, len);
}

__ALWAYS_INLINE
GLB_ROOT_CLK_Type ATTR_CLOCK_SECTION GLB_Get_Root_CLK_Sel(void)
{
    return RomDriver_GLB_Get_Root_CLK_Sel();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_System_CLK_Div(uint8_t hclkDiv, uint8_t bclkDiv)
{
    return RomDriver_GLB_Set_System_CLK_Div(hclkDiv, bclkDiv);
}

__ALWAYS_INLINE
uint8_t ATTR_CLOCK_SECTION GLB_Get_BCLK_Div(void)
{
    return RomDriver_GLB_Get_BCLK_Div();
}

__ALWAYS_INLINE
uint8_t ATTR_CLOCK_SECTION GLB_Get_HCLK_Div(void)
{
    return RomDriver_GLB_Get_HCLK_Div();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION Update_SystemCoreClockWith_XTAL(GLB_PLL_XTAL_Type xtalType)
{
    return RomDriver_Update_SystemCoreClockWith_XTAL(xtalType);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_System_CLK(GLB_PLL_XTAL_Type xtalType, GLB_SYS_CLK_Type clkFreq)
{
    return RomDriver_GLB_Set_System_CLK(xtalType, clkFreq);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION System_Core_Clock_Update_From_RC32M(void)
{
    return RomDriver_System_Core_Clock_Update_From_RC32M();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_SF_CLK(uint8_t enable, GLB_SFLASH_CLK_Type clkSel, uint8_t div)
{
    return RomDriver_GLB_Set_SF_CLK(enable, clkSel, div);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION GLB_Set_PKA_CLK_Sel(GLB_PKA_CLK_Type clkSel)
{
    return RomDriver_GLB_Set_PKA_CLK_Sel(clkSel);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_SW_System_Reset(void)
{
    return RomDriver_GLB_SW_System_Reset();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_SW_CPU_Reset(void)
{
    return RomDriver_GLB_SW_CPU_Reset();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_SW_POR_Reset(void)
{
    return RomDriver_GLB_SW_POR_Reset();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_Select_Internal_Flash(void)
{
    return RomDriver_GLB_Select_Internal_Flash();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_Select_External_Flash(void)
{
    return RomDriver_GLB_Select_External_Flash();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_Deswap_Flash_Pin(void)
{
    return RomDriver_GLB_Deswap_Flash_Pin();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_Swap_Flash_Pin(void)
{
    return RomDriver_GLB_Swap_Flash_Pin();
}

