RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/src/bl602_romapi.c
#if 0
__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_GPIO_Init(GLB_GPIO_Cfg_Type *cfg)
{
    return RomDriver_GLB_GPIO_Init(cfg);
}
#endif

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_GPIO_OUTPUT_Enable(GLB_GPIO_Type gpioPin)
{
    return RomDriver_GLB_GPIO_OUTPUT_Enable(gpioPin);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_GPIO_OUTPUT_Disable(GLB_GPIO_Type gpioPin)
{
    return RomDriver_GLB_GPIO_OUTPUT_Disable(gpioPin);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION GLB_GPIO_Set_HZ(GLB_GPIO_Type gpioPin)
{
    return RomDriver_GLB_GPIO_Set_HZ(gpioPin);
}

__ALWAYS_INLINE
uint8_t ATTR_TCM_SECTION GLB_GPIO_Get_Fun(GLB_GPIO_Type gpioPin)
{
    return RomDriver_GLB_GPIO_Get_Fun(gpioPin);
}

#if 0
__ALWAYS_INLINE
void ATTR_TCM_SECTION HBN_Mode_Enter(HBN_APP_CFG_Type *cfg)
{
    return RomDriver_HBN_Mode_Enter(cfg);
}
#endif

__ALWAYS_INLINE
void ATTR_TCM_SECTION HBN_Power_Down_Flash(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_HBN_Power_Down_Flash(flash_cfg);
}

#if 0
__ALWAYS_INLINE
void ATTR_TCM_SECTION HBN_Enable(uint8_t aGPIOIeCfg, HBN_LDO_LEVEL_Type ldoLevel, HBN_LEVEL_Type hbnLevel)
{
    return RomDriver_HBN_Enable(aGPIOIeCfg, ldoLevel, hbnLevel);
}
#endif

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Reset(void)
{
    return RomDriver_HBN_Reset();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Ldo11_Aon_Vout(HBN_LDO_LEVEL_Type ldoLevel)
{
    return RomDriver_HBN_Set_Ldo11_Aon_Vout(ldoLevel);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Ldo11_Rt_Vout(HBN_LDO_LEVEL_Type ldoLevel)
{
    return RomDriver_HBN_Set_Ldo11_Rt_Vout(ldoLevel);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Ldo11_Soc_Vout(HBN_LDO_LEVEL_Type ldoLevel)
{
    return RomDriver_HBN_Set_Ldo11_Soc_Vout(ldoLevel);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_32K_Sel(HBN_32K_CLK_Type clkType)
{
    return RomDriver_HBN_32K_Sel(clkType);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Set_ROOT_CLK_Sel(HBN_ROOT_CLK_Type rootClk)
{
    return RomDriver_HBN_Set_ROOT_CLK_Sel(rootClk);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_On_Xtal_32K(void)
{
    return RomDriver_HBN_Power_On_Xtal_32K();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_Off_Xtal_32K(void)
{
    return RomDriver_HBN_Power_Off_Xtal_32K();
}

#if 0
__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_On_RC32K(void)
{
    return RomDriver_HBN_Power_On_RC32K();
}
#endif

#if 0
__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Power_Off_RC32K(void)
{
    return RomDriver_HBN_Power_Off_RC32K();
}
#endif

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION HBN_Trim_RC32K(void)
{
    return RomDriver_HBN_Trim_RC32K();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Hw_Pu_Pd_Cfg(uint8_t enable)
{
    return RomDriver_HBN_Hw_Pu_Pd_Cfg(enable);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Pin_WakeUp_Mask(uint8_t maskVal)
{
    return RomDriver_HBN_Pin_WakeUp_Mask(maskVal);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_GPIO7_Dbg_Pull_Cfg(BL_Fun_Type pupdEn, BL_Fun_Type iesmtEn, BL_Fun_Type dlyEn, uint8_t dlySec)
{
    return RomDriver_HBN_GPIO7_Dbg_Pull_Cfg(pupdEn, iesmtEn, dlyEn, dlySec);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION HBN_Set_Embedded_Flash_Pullup(uint8_t enable)
{
    return RomDriver_HBN_Set_Embedded_Flash_Pullup(enable);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION L1C_Set_Wrap(BL_Fun_Type wrap)
{
    return RomDriver_L1C_Set_Wrap(wrap);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION L1C_Set_Way_Disable(uint8_t disableVal)
{
    return RomDriver_L1C_Set_Way_Disable(disableVal);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION L1C_IROM_2T_Access_Set(uint8_t enable)
{
    return RomDriver_L1C_IROM_2T_Access_Set(enable);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION PDS_Reset(void)
{
    return RomDriver_PDS_Reset();
}

#if 0
__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION PDS_Enable(PDS_CTL_Type *cfg, PDS_CTL4_Type *cfg4, uint32_t pdsSleepCnt)
{
    return RomDriver_PDS_Enable(cfg, cfg4, pdsSleepCnt);
}
#endif

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION PDS_Force_Config(PDS_CTL2_Type *cfg2, PDS_CTL3_Type *cfg3)
{
    return RomDriver_PDS_Force_Config(cfg2, cfg3);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION PDS_RAM_Config(PDS_RAM_CFG_Type *ramCfg)
{
    return RomDriver_PDS_RAM_Config(ramCfg);
}

#if 0
__ALWAYS_INLINE
BL_Err_Type ATTR_TCM_SECTION PDS_Default_Level_Config(PDS_DEFAULT_LV_CFG_Type *defaultLvCfg, PDS_RAM_CFG_Type *ramCfg, uint32_t pdsSleepCnt)
{
    return RomDriver_PDS_Default_Level_Config(defaultLvCfg, ramCfg, pdsSleepCnt);
}
#endif

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Trim_RC32M(void)
{
    return RomDriver_PDS_Trim_RC32M();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Select_RC32M_As_PLL_Ref(void)
{
    return RomDriver_PDS_Select_RC32M_As_PLL_Ref();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Select_XTAL_As_PLL_Ref(void)
{
    return RomDriver_PDS_Select_XTAL_As_PLL_Ref();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Power_On_PLL(PDS_PLL_XTAL_Type xtalType)
{
    return RomDriver_PDS_Power_On_PLL(xtalType);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Enable_PLL_All_Clks(void)
{
    return RomDriver_PDS_Enable_PLL_All_Clks();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Disable_PLL_All_Clks(void)
{
    return RomDriver_PDS_Disable_PLL_All_Clks();
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Enable_PLL_Clk(PDS_PLL_CLK_Type pllClk)
{
    return RomDriver_PDS_Enable_PLL_Clk(pllClk);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Disable_PLL_Clk(PDS_PLL_CLK_Type pllClk)
{
    return RomDriver_PDS_Disable_PLL_Clk(pllClk);
}

__ALWAYS_INLINE
BL_Err_Type ATTR_CLOCK_SECTION PDS_Power_Off_PLL(void)
{
    return RomDriver_PDS_Power_Off_PLL();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION SEC_Eng_Turn_On_Sec_Ring(void)
{
    return RomDriver_SEC_Eng_Turn_On_Sec_Ring();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION SEC_Eng_Turn_Off_Sec_Ring(void)
{
    return RomDriver_SEC_Eng_Turn_Off_Sec_Ring();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_init(const struct sf_ctrl_cfg_type *p_sf_ctrl_cfg)
{
    return RomDriver_SFlash_Init(p_sf_ctrl_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_setspimode(uint8_t mode)
{
    return RomDriver_SFlash_SetSPIMode(mode);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_read_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Read_Reg(flash_cfg, reg_index, reg_value, reg_len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_write_reg(spi_flash_cfg_type *flash_cfg, uint8_t reg_index, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Write_Reg(flash_cfg, reg_index, reg_value, reg_len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_busy(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Busy(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_write_enable(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_qspi_enable(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Qspi_Enable(flash_cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_volatile_reg_write_enable(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Volatile_Reg_Write_Enable(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_chip_erase(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Chip_Erase(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_sector_erase(spi_flash_cfg_type *flash_cfg, uint32_t sec_num)
{
    return RomDriver_SFlash_Sector_Erase(flash_cfg, sec_num);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_blk32_erase(spi_flash_cfg_type *flash_cfg, uint32_t blk_num)
{
    return RomDriver_SFlash_Blk32_Erase(flash_cfg, blk_num);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_blk64_erase(spi_flash_cfg_type *flash_cfg, uint32_t blk_num)
{
    return RomDriver_SFlash_Blk64_Erase(flash_cfg, blk_num);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_erase(spi_flash_cfg_type *flash_cfg, uint32_t startaddr, uint32_t endaddr)
{
    return RomDriver_SFlash_Erase(flash_cfg, startaddr, endaddr);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_program(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_SFlash_Program(flash_cfg, io_mode, addr, data, len);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_get_uniqueid(uint8_t *data, uint8_t idLen)
{
    return RomDriver_SFlash_GetUniqueId(data, idLen);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_get_jedecid(spi_flash_cfg_type *flash_cfg, uint8_t *data)
{
    return RomDriver_SFlash_GetJedecId(flash_cfg, data);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_get_deviceid(uint8_t *data, uint8_t is_32bits_addr)
{
    return RomDriver_SFlash_GetDeviceId(data);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_powerdown(void)
{
    return RomDriver_SFlash_Powerdown();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_release_powerdown(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Releae_Powerdown(flash_cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_set_burst_wrap(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_SetBurstWrap(flash_cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_disable_burst_wrap(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_DisableBurstWrap(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_software_reset(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Software_Reset(flash_cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_reset_continue_read(spi_flash_cfg_type *flash_cfg)
{
    return RomDriver_SFlash_Reset_Continue_Read(flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_set_idbus_cfg(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t cont_read, uint32_t addr, uint32_t len, uint8_t bank)
{
    return RomDriver_SFlash_Set_IDbus_Cfg(flash_cfg, io_mode, cont_read, addr, len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_idbus_read_enable(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t cont_read, uint8_t bank)
{
    return RomDriver_SFlash_IDbus_Read_Enable(flash_cfg, io_mode, cont_read);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_cache_enable_set(uint8_t way_disable)
{
    return RomDriver_SFlash_Cache_Enable_Set(way_disable);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_cache_flush(void)
{
    return RomDriver_SFlash_Cache_Flush();
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_cache_read_enable(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t cont_read, uint8_t way_disable)
{
    return RomDriver_SFlash_Cache_Read_Enable(flash_cfg, io_mode, cont_read, way_disable);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_l1c_hit_count_get(uint32_t *hit_count_low, uint32_t *hit_count_high)
{
    return RomDriver_SFlash_Cache_Hit_Count_Get(hit_count_low, hit_count_high);
}

__ALWAYS_INLINE
uint32_t ATTR_TCM_SECTION bflb_l1c_miss_count_get(void)
{
    return RomDriver_SFlash_Cache_Miss_Count_Get();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sflash_cache_read_disable(void)
{
    return RomDriver_SFlash_Cache_Read_Disable();
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_read(spi_flash_cfg_type *flash_cfg, uint8_t io_mode, uint8_t cont_read, uint32_t addr, uint8_t *data, uint32_t len)
{
    return RomDriver_SFlash_Read(flash_cfg, io_mode, cont_read, addr, data, len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_read_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t read_reg_cmd, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Read_Reg_With_Cmd(flash_cfg, read_reg_cmd, reg_value, reg_len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_write_reg_with_cmd(spi_flash_cfg_type *flash_cfg, uint8_t write_reg_cmd, uint8_t *reg_value, uint8_t reg_len)
{
    return RomDriver_SFlash_Write_Reg_With_Cmd(flash_cfg, write_reg_cmd, reg_value, reg_len);
}

