RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl602/std/src/bl602_romapi.c
#if 0
__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sflash_restore_from_powerdown(spi_flash_cfg_type *p_flash_cfg, uint8_t flashContRead)
{
    return RomDriver_SFlash_Restore_From_Powerdown(p_flash_cfg, flashContRead);
}
#endif

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sf_cfg_init_ext_flash_gpio(uint8_t ext_flash_pin)
{
    return RomDriver_SF_Cfg_Init_Ext_Flash_Gpio(ext_flash_pin);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_cfg_init_internal_flash_gpio(void)
{
    return RomDriver_SF_Cfg_Init_Internal_Flash_Gpio();
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sf_cfg_deinit_ext_flash_gpio(uint8_t ext_flash_pin)
{
    return RomDriver_SF_Cfg_Deinit_Ext_Flash_Gpio(ext_flash_pin);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_cfg_restore_gpio17_fun(uint8_t fun)
{
    return RomDriver_SF_Cfg_Restore_GPIO17_Fun(fun);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sf_cfg_get_flash_cfg_need_lock(uint32_t flash_id, spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank)
{
    return RomDriver_SF_Cfg_Get_Flash_Cfg_Need_Lock(flash_id, p_flash_cfg);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_sf_cfg_init_flash_gpio(uint8_t flash_pin_cfg, uint8_t restore_default)
{
    return RomDriver_SF_Cfg_Init_Flash_Gpio(flash_pin_cfg, restore_default);
}

__ALWAYS_INLINE
uint32_t ATTR_TCM_SECTION bflb_sf_cfg_flash_identify(uint8_t call_from_flash, uint8_t flash_pin_cfg, uint8_t restore_default, spi_flash_cfg_type *p_flash_cfg, uint8_t group, uint8_t bank)
{
    uint8_t auto_scan = 0;
    uint8_t flash_pin = 0;
    auto_scan = ((flash_pin_cfg >> 7) & 1);
    flash_pin = (flash_pin_cfg & 0x7F);
    return RomDriver_SF_Cfg_Flash_Identify(call_from_flash, auto_scan, flash_pin, restore_default, p_flash_cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_enable(const struct sf_ctrl_cfg_type *cfg)
{
    return RomDriver_SF_Ctrl_Enable(cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_select_pad(uint8_t sel)
{
    return RomDriver_SF_Ctrl_Select_Pad(sel);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_set_owner(uint8_t owner)
{
    return RomDriver_SF_Ctrl_Set_Owner(owner);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_disable(void)
{
    return RomDriver_SF_Ctrl_Disable();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_enable_be(void)
{
    return RomDriver_SF_Ctrl_AES_Enable_BE();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_enable_le(void)
{
    return RomDriver_SF_Ctrl_AES_Enable_LE();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_set_region(uint8_t region, uint8_t enable, uint8_t hw_key, uint32_t start_addr, uint32_t end_addr, uint8_t locked)
{
    return RomDriver_SF_Ctrl_AES_Set_Region(region, enable, hw_key, start_addr, end_addr, locked);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_set_key(uint8_t region, uint8_t *key, uint8_t keyType)
{
    return RomDriver_SF_Ctrl_AES_Set_Key(region, key, keyType);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_set_key_be(uint8_t region, uint8_t *key, uint8_t keyType)
{
    return RomDriver_SF_Ctrl_AES_Set_Key_BE(region, key, keyType);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_set_iv(uint8_t region, uint8_t *iv, uint32_t addr_offset)
{
    return RomDriver_SF_Ctrl_AES_Set_IV(region, iv, addr_offset);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_set_iv_be(uint8_t region, uint8_t *iv, uint32_t addr_offset)
{
    return RomDriver_SF_Ctrl_AES_Set_IV_BE(region, iv, addr_offset);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_enable(void)
{
    return RomDriver_SF_Ctrl_AES_Enable();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_aes_disable(void)
{
    return RomDriver_SF_Ctrl_AES_Disable();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_set_flash_image_offset(uint32_t addr_offset, uint8_t group, uint8_t bank)
{
    return RomDriver_SF_Ctrl_Set_Flash_Image_Offset(addr_offset);
}

__ALWAYS_INLINE
uint32_t ATTR_TCM_SECTION bflb_sf_ctrl_get_flash_image_offset(uint8_t group, uint8_t bank)
{
    return RomDriver_SF_Ctrl_Get_Flash_Image_Offset();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_select_clock(uint8_t sahb_type)
{
    return RomDriver_SF_Ctrl_Select_Clock(sahb_type);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_sendcmd(struct sf_ctrl_cmd_cfg_type *cfg)
{
    return RomDriver_SF_Ctrl_SendCmd(cfg);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_icache_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid)
{
    return RomDriver_SF_Ctrl_Icache_Set(cfg, cmd_valid);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_icache2_set(struct sf_ctrl_cmd_cfg_type *cfg, uint8_t cmd_valid)
{
    return RomDriver_SF_Ctrl_Icache2_Set(cfg, cmd_valid);
}

__ALWAYS_INLINE
uint8_t ATTR_TCM_SECTION bflb_sf_ctrl_get_busy_state(void)
{
    return RomDriver_SF_Ctrl_GetBusyState();
}

__ALWAYS_INLINE
uint8_t ATTR_TCM_SECTION bflb_sf_ctrl_is_aes_enable(void)
{
    return RomDriver_SF_Ctrl_Is_AES_Enable();
}

__ALWAYS_INLINE
uint8_t ATTR_TCM_SECTION bflb_sf_ctrl_get_clock_delay(void)
{
    return RomDriver_SF_Ctrl_Get_Clock_Delay();
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_sf_ctrl_set_clock_delay(uint8_t delay)
{
    return RomDriver_SF_Ctrl_Set_Clock_Delay(delay);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_state_save(spi_flash_cfg_type *p_flash_cfg, uint32_t *offset, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_State_Save(p_flash_cfg, offset);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_state_restore(spi_flash_cfg_type *p_flash_cfg, uint32_t offset, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_State_Restore(p_flash_cfg, offset);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_erase_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t startaddr, int len, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_Erase_Need_Lock(p_flash_cfg, startaddr, startaddr+len-1);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_write_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_Write_Need_Lock(p_flash_cfg, addr, data, len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_read_need_lock(spi_flash_cfg_type *p_flash_cfg, uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_Read_Need_Lock(p_flash_cfg, addr, data, len);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_get_jedecid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_GetJedecId_Need_Lock(p_flash_cfg, data);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_get_deviceid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t is_32bits_addr, uint8_t *data, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_GetDeviceId_Need_Lock(p_flash_cfg, data);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_get_uniqueid_need_lock(spi_flash_cfg_type *p_flash_cfg, uint8_t *data, uint8_t idLen, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_GetUniqueId_Need_Lock(p_flash_cfg, data, idLen);
}

__ALWAYS_INLINE
int ATTR_TCM_SECTION bflb_xip_sflash_read_via_cache_need_lock(uint32_t addr, uint8_t *data, uint32_t len, uint8_t group, uint8_t bank)
{
    return RomDriver_XIP_SFlash_Read_Via_Cache_Need_Lock(addr, data, len);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_xip_sflash_opt_enter(uint8_t *aes_enable)
{
    return RomDriver_XIP_SFlash_Opt_Enter(aes_enable);
}

__ALWAYS_INLINE
void ATTR_TCM_SECTION bflb_xip_sflash_opt_exit(uint8_t aes_enable)
{
    return RomDriver_XIP_SFlash_Opt_Exit(aes_enable);
}

__ALWAYS_INLINE
uint32_t ATTR_TCM_SECTION BFLB_Soft_CRC32(void *dataIn, uint32_t len)
{
    return RomDriver_BFLB_Soft_CRC32(dataIn, len);
}
